#+TITLE: Relay Detection with SyMon
#+AUTHOR: Masaki Waga
#+EMAIL: mwaga@fos.kuis.kyoto-u.ac.jp
#+OPTIONS: toc:nil

This is an example to detect SMTP relay using [[https://github.com/MasWag/SyMon/][SyMon]]. See [[https://www.exim.org/exim-html-3.20/doc/html/spec_46.html#SEC813][this document]] for the detail of the relevant configuration of Exim4. This example consists of a Python script =convert_log.py= to clean up and construct a log file for SyMon and the files required by SyMon.

* Example Execution

Here is an example of the log generated by ~convert_log.py~.

#+BEGIN_SRC txt :tangle example.log
arrival	1rXYZa-0002BC-GH	alice@example.com	example.com	mail.example.com	PLAIN	alice	0.0
arrival	1rXYZa-0002BD-IJ	dave@gmail.com	gmail.com	mail-ot1-f45.google.com	none	none	0.1
arrival	1rXYZa-0002BE-KL	erin@example.com	example.com	mail.example.com	LOGIN	erin	0.2
delivery	1rXYZa-0002BC-GH	bob@example.com	example.com	0.3
delivery	1rXYZa-0002BD-IJ	carol@yahoo.com	yahoo.com	0.4
delivery	1rXYZa-0002BE-KL	frank@hotmail.com	hotmail.com	0.5
complete	1rXYZa-0002BC-GH	0.6
complete	1rXYZa-0002BD-IJ	0.7
complete	1rXYZa-0002BE-KL	0.8
#+END_SRC

Here is the command to run SyMon with a monitoring result:

#+BEGIN_SRC sh :results output replace :exports both
  cat example.log | 
      ./relay.symon |
      ./pretty_print.sh
#+END_SRC

#+RESULTS:
: @0.400000.	(time-point 4)	id: 1rXYZa-0002BD-IJ	sender: dave@gmail.com	host: mail-ot1-f45.google.com	user: none	auth: none	destination: carol@yahoo.com	
